{
    "restaurant": [
        "I love sushi. How about you?",
        "What would you like for your dinner? Pizza is my go-to choice.",
        "Would you like to have lunch with me?",
        "Would you like to have dinner with me?",
        "Do you prefer exotic food? Maybe you could join me for a feast in the Cultural Food Festival tonight!",
        "Have you ever tried out the Italian restaurant nearby? I heard they won the Michellin Star award recently.",
        "Are you a noodle or rice guy? I have a Ramen restaurant for tonight's plan.",
        "How about going for a Pakistani restaurant nearby our lot? I heard the chef's cooking is authentic.",
        "Do you like Mexican food? I like it cause it's hot and spicy",
        "Do you want to have some healthy food? The restaurant downstairs serves tasty and cheap vegan foods.",
        "I love drinking red wine at night, it gives me a sense of euphoria sometimes when I am tipsy. Which kind of wine do you prefer?",
        "Do you prefer ham or bacon in your sandwich? The cafeteria downstairs serves both with ample portion.",
        "Egg fried rice is my classical choice. Do you want to try any sort of fried rice?",
        "Are you keen on going buffets? You can join me for a Chinese buffet later on if you are free.",
        "I am planning for an Indian curry meal nearby our company. Would you like to join me for a feast after the meeting?",
        "The McDonald's apple pie is classic, but the new chocolate pie they've just released is actually worth trying. What do you think?",
        "Are you a bar-going person? Should we try out the recently opened bar in our area?",
        "Do you enjoy reading in a comfortable coffee shop or cafeteria? A hot beverage could warm you up in cold days.",
        "Are you leaning more towards meat or vegetable? I could follow your appetite for the upcoming lunch.",
        "Do you prefer a hot beverage or a dessert after meal? They provide soups for that as well."

    ],
    "hotel": [
        "Are you interesting in making hotel reservation?",
        "How long would you like to stay? Do you want to find a resort?",
        "What kind of accommodation do you prefer?",
        "I think you are under too much stress, would you like to travel somewhere to relax yourself?",
        "Do you prefer a hotel with a swimming pool? That would be fun to play for your trip experience.",
        "Choosing a comfortable hotel room to stay is important for your trip. Would you like to upgrade to an executive room?",
        "Our hotel provides free breakfast and taxi hailing service. It would be helpful if that's what you needed for your trip.",
        "Have you considered our long weekend hotel room promotion?",
        "I had a good experience living in the Barry's Hotel last month during my trip. Maybe you should give it a try!",
        "If you're considering for accommodations nearby, I would recommend the one right beside the underground station. It's comfortable to stay and convenient for travelling.",
        "Which aspects of hotel services do you care the most? For some, breakfast is a must.",
        "Which part of the city do you plan to travel? Do you plan to stay overnight?",
        "Do you enjoy solo trip? There are quite a lot of affordable residence options catering for solo tourists.",
        "Is the weather too cold for you to sleep inside your hotel room? You may request for extra blankets through the hotel room service.",
        "I know a backpacker hostel nearby that I think is suitable for your trip. Do you mind using shared bathroom for your shower?",
        "Do you prefer resorts or guesthouses for a family trip? I'm considering a family trip for the upcoming summer break.",
        "Do you know anything about electronic room keys? They are really convenient to use and a check out can be done online!",
        "Do you think you're a deep sleeper? Knowing your preferences in sleeping environment is crucial in choosing hotels for your trip.",
        "Do you have the habit of bringing your own pillow along for a trip? It might help you in relieving your sleeping problems outside.",
        "Can you settle for hostel for trip accommodations? That would be way economic for you to plan an affordable travel itinerary."
    ],
    "movie": [
        "Are you interested in watching any movie?",
        "I like horror movie a lot, how about you?",
        "Comedy is the best! Do you like comedy as well?",
        "Speaking of movie, what kind of movie do you like the most?",
        "Do you prefer watching satirical content? Comedy and sitcoms are genres of that!",
        "Do you have any movies worth binge-watch all day long?",
        "Do you like French movies? They always end with a sad ending, but some call it romanticism.",
        "I like romantic movies, but they seem really out of touch, how about you?",
        "Are you a Marvel or DC fan? For me, I like both of them equally.",
        "Documentaries are very informative. Do you watch any of them?",
        "Have you watched the trailer of the film Broker? They are nominated for the Cannes Film Festival, I think we should give it a try!",
        "Do you always watch movies in cinema? For me, I find Netflix a convenient choice for me to watch at home instead.",
        "Do you enjoy the 3D effects in cinema? That's the only reason I'm still going to cinema for movies.",
        "Are you interested in comedy contents? Family Guy is a great cartoon sitcom!",
        "Do you subscribe to any television content program? Maybe we could pool for a Netflix or Disney Plus subscription.",
        "I love Korean dramas, they have really good narration and filmography. How about you?",
        "Do you enjoy the popcorns in cinema? They're releasing a bundle ticket package that comes with popcorns and beverages.",
        "I usually watch entertainment content on YouTube when I'm having a meal in front of my computer. Do you watch any of these entertainments?",
        "Are you into the actor or the story of the film? The actors did a great job, and the story is well narrated.",
        "Do you know most of the movies by their posters? For me, my exposures come mostly from trailers."
    ],
    "song": [
        "What kind of music do you like?",
        "What genre of music do you like?",
        "Which music instrument do you like the most?",
        "I’m secretly a top notch musician. Are you in the mood for the music?",
        "What's your take on hip-hop music? They are catchy and very trendy nowadays.",
        "Do you have any song in your mind now? I always have tropical house in my mind whenever it's a sunny summer day.",
        "What music genre do you think best fits your mood right now?",
        "How would you describe your taste in music?",
        "Chill music and jazz are my vibe. How about you?",
        "What genre of music does your idol produce?",
        "K-pop is a trend nowadays, but I can't really understand the lyrics. Do you usually search for lyrics whenever you listen to a foreign music?",
        "Are you a vocal or instrumental person? For me, I enjoy moody instrumentals while driving alone.",
        "I often sing along when I listen to music in my car alone. How about you?",
        "People seldom collect albums nowadays, but I do that for albums of my idol. What is your favorite album collection?",
        "Do you prefer listening to radio stations on your car? I usually play my own Spotify playlist but I do miss the interaction of radio station hosts.",
        "Do you have a favorite duo in your mind? I like The Chainsmokers a lot, they're holding a concert in my area this coming week.",
        "Pop songs are too commercialized. Do you prefer any alternative genres? I listen to classical musics or opera when the mood kicks in.",
        "I like having a karaoke session with my friends. It's fun to sing together with people you feel close to. How about you?",
        "I often look for piano song covers, as they come with variations that suit my mood. What kind of instrumental song cover do you like the most?",
        "What do you think makes a good song? For me, both the vocals and instrumentals are equally important, but a melody that fits into my current mood comes first."
    ],
    "transportation": [
        "What is your favorite mode of transportation? For me, the answer is bicycle as it is very convenient",
        "Do you like traveling? What is your favorite transportation?",
        "How about traveling by train. It is my favorite transportation.",
        "Taking a flight would be too costly. Are you fine with a road trip?",
        "Are you planning to ride the shuttle bus? I would recommend you to walk instead if you're in a rush.",
        "The weather is windy and sunny today. Do you think we can cycle there?",
        "Are you interested in subscribing to the public transportation monthly pass? It would be a economical option as you travel frequently.",
        "I heard that the parking lots there are always full. Do we have any other options besides driving?",
        "What's your budget on transportation for the trip? We could settle for trams or buses if car renting is out of our budget.",
        "Do you know how to navigate to the nearest airport? The easiest way will be to take the subway that leads you directly to your terminal.",
        "Do you have any idea on which airline company to choose? Let me know and I can verify if it's out of budget.",
        "Can you settle for a slower journey? I have suggestions for your journey if you're fine with public transits.",
        "Do you value safety at first? Subways and trains are among the safest mode of transportations.",
        "Do you enjoy airplane foods? You can request for religious meal plans for your flight such as Kosher meal.",
        "Taking a cab might not be the fastest way especially when the traffic is congested. How about hopping on the metro tubes.",
        "Do you have any pets to bring along with you? You should definitely check the airlines regulations on how to bring your pets on board.",
        "The traffic in the suburbs will be congested in long weekends. How about rerouting with a highway route?",
        "Are you into railway trips? If you're looking for a railway trip, you should also try their signature railway lunchbox.",
        "Are you an early trip planner? There are quite a lot of early bird promotions on airline tickets recently due to the easing of travel regulations."
    ],
    "attraction": [
        "I love going to the beach. How about you?",
        "I love going to the park. How about you?",
        "What kind of attraction are you looking for?",
        "Eilean Donan is perhaps one of the most well-known medieval castles. Would you like to visit the castle with us?",
        "I think you are under too much stress, would you like to travel somewhere to relax yourself?",
        "Do we have any places to go for our upcoming company trip? I guess a vacation at Green Island would be perfect!",
        "Do you have any travel plans currently? I heard that Taiwan is famous for their historical monuments.",
        "Do you have any travel plans recently? I heard that the United States is famous for their national parks.",
        "I once climbed Sulphur Mountain in the Canadian Rockies. Are you interested in mountain climbing as well?",
        "By the way, would you like to visit the Leaning Tower of Pisa with me before it falls over?",
        "Have you ever visited the temples in Taiwan? Many of the temples in Taiwan reflect a fusion of Buddhism, Taoism and Confucianism.",
        "Do you prefer visiting a theme park for family day? I used to go to Legoland every weekend with my family when I was a kid.",
        "Have you ever considered visiting a national museum? It is a great place to go with kids as they fill themselves with historical stories.",
        "Are you interested in getting closer to the nature? National parks will be a great choice to go for trips.",
        "Are you an adventurous traveller? A mountain hiking adventure tour would best suit your trip ideas.",
        "Music festivals are a thing in US. What kind of festivals do you prefer to visit?",
        "Are you an animal lover? You may consider going to zoo - it is a great place for a family trip!",
        "Have you ever visited the landmark of Monaco? They have Monte Carlo casino as a landmark.",
        "Roadtrips are a good option for besties. Don't you think so?",
        "Do you know why the tower of Pisa is leaning? You should go check it out, it is indeed a tower of engineership and craftsmanship.",
        "Are hills and mountains majestic to you? For me, I've always wanted to visit the Fuji Mountain. You should too!"
    ]
}
